{
  "backend/main.mo": "Main Motoko actor defining core types (Dress, Group, UserProfile, etc.), persistent storage maps, and business logic for a dress-sharing platform with authorization, blob storage, Stripe payments, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report documenting a fix for Select.Item empty value prop errors in DressFilters component, ensuring non-empty string values for all filter options.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing the ShareDrape platform's UI structure including routing, authentication, dress listings, group creation, and various dashboard pages.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes, including primary, secondary, accent, and sidebar colors using oklch color space.",
  "frontend/index.html": "HTML entry point for the ShareDrape React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (landing, listings, dress details, group/circle dashboards, admin, payments, etc.) wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/DressCard.tsx": "Reusable dress card component displaying dress photo, brand, color, occasion badge, pricing, and slot availability with hover effects and navigation to detail page.",
  "frontend/src/components/DressCarousel.tsx": "Carousel wrapper component using shadcn Carousel to display multiple DressCard components with navigation controls and responsive column layout.",
  "frontend/src/components/DressDetails.tsx": "Detailed dress information component showing brand, color, size, occasion, location, pricing breakdown, priority fees, and request-to-join button with product link.",
  "frontend/src/components/DressFilters.tsx": "Filter component for dress listings with dropdowns for size and occasion, text inputs for color and city, and number inputs for min/max price range. Converts 'all-*' placeholder values to empty strings for state management.",
  "frontend/src/components/DressImageGallery.tsx": "Image carousel component displaying dress photos with navigation arrows and thumbnail grid. Shows main image with previous/next controls and highlights the active thumbnail.",
  "frontend/src/components/group-creation/Step1PhotoUpload.tsx": "First step of group creation wizard that handles uploading 3-10 dress photos and an optional product link, with preview thumbnails and validation.",
  "frontend/src/components/group-creation/Step2DressDetails.tsx": "Second step collecting dress metadata including brand, color, size, occasion, and original price with form validation.",
  "frontend/src/components/group-creation/Step3AuthenticityProof.tsx": "Third step for uploading authenticity proof documents (bill, receipt, or certificate) as image or PDF files.",
  "frontend/src/components/group-creation/Step4GroupConfig.tsx": "Fourth step configuring group size (3-4 members) and rotation city/hub for dress sharing logistics.",
  "frontend/src/components/group-creation/Step5SlotPricing.tsx": "Fifth step setting priority slot pricing with auto-calculated or custom fees based on rotation position and dress value.",
  "frontend/src/components/group-creation/Step6Preview.tsx": "Final preview step displaying all collected data and handling group creation submission by converting files to ExternalBlob and calling the backend mutation.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, navigation links, notification bell, and login button. Includes responsive mobile menu, profile setup modal trigger, and footer with quick links.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/NotificationBell.tsx": "Notification bell icon button with badge showing unread count. Currently a placeholder with hardcoded zero unread notifications.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation requiring name, city, body measurements (bust/waist/hip), and optional profile photo. Uploads photo as ExternalBlob and saves profile with default trust score and balances.",
  "frontend/src/components/ProgressBar.tsx": "Reusable progress bar component with optional label and percentage display. Calculates percentage from value/max ratio and renders using shadcn Progress component.",
  "frontend/src/components/SearchBar.tsx": "Search input with debounced query (300ms) that displays dropdown results with dress thumbnails. Navigates to dress detail page on result click and applies current filters to search.",
  "frontend/src/components/SkeletonLoader.tsx": "Loading skeleton component with variants for card grid, text lines, single image, or list items. Accepts count prop to render multiple skeleton elements.",
  "frontend/src/components/TrustBadges.tsx": "Static display component showing three trust badges (escrow payments, AI damage detection, verified cleaning) with icons, titles, and descriptions in a responsive grid.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, dresses, and groups via the backend actor, including search, creation, and photo upload operations.",
  "frontend/src/index.css": "Global styles with Tailwind CSS, custom OKLCH color system for light/dark themes, premium fashion palette (rose pink, ivory, charcoal, gold), and typography using Playfair Display and DM Sans fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Placeholder page for admin panel functionality to manage listings, disputes, and platform operations.",
  "frontend/src/pages/CircleDashboardPage.tsx": "Placeholder page for managing user's style circle.",
  "frontend/src/pages/CleaningPartnerPortalPage.tsx": "Placeholder page for cleaning partners to upload certificates and manage cleaning jobs.",
  "frontend/src/pages/CreateGroupPage.tsx": "Multi-step form page (6 steps) for creating a dress sharing group, including photo upload, dress details, authenticity proof, group configuration, slot pricing, and preview.",
  "frontend/src/pages/DressDetailPage.tsx": "Page displaying detailed information about a specific dress with image gallery and details, fetched by dress ID from route params.",
  "frontend/src/pages/DressListingsPage.tsx": "Browse page showing filterable grid of designer dresses with search bar, responsive filters (desktop sidebar, mobile sheet), and skeleton loading states.",
  "frontend/src/pages/GroupDashboardPage.tsx": "Placeholder page for group management features including real-time chat, rotation tracking, and handover management.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with hero section, trending dress carousel, how-it-works steps, and CTAs for creating/joining groups. Uses animated hero background and displays trust badges.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple payment failure page displaying a red X icon and error message prompting users to retry payment.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Simple payment success page displaying a green checkmark icon and confirmation message.",
  "frontend/src/pages/ResaleMarketplacePage.tsx": "Placeholder page for upcoming resale marketplace feature showing 'Coming soon' message.",
  "frontend/src/pages/StyleCirclesPage.tsx": "Placeholder page for upcoming style circles feature showing 'Coming soon' message for permanent fashion sharing groups.",
  "frontend/src/pages/UserProfilePage.tsx": "Placeholder page for user profile feature showing 'Coming soon' message for viewing groups, ratings, and earnings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (rosePink, ivory, charcoal, gold), Playfair Display and DM Sans fonts, custom animations, and shadcn/ui theme variables using OKLCH color space.",
  "project_state.json": "Project metadata defining ShareDrape/CoVogue as a luxury fashion co-ownership platform with architectural notes, known issues (Select.Item empty value bug), and comprehensive feature list tracking implementation status."
}